'''Напишите код, который запрашивает число и сообщает является ли оно простым или составным. 
Используйте правило для проверки: «Число является простым, если делится нацело только на единицу и на себя». 
Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.
'''

# Запрос числа от пользователя
number = int(input("Введите число: "))

# Проверка ограничений на ввод
if number < 0 or number > 100000:
    print("Число должно быть положительным и не превышать 100000")
else:
    # Проверка числа на простоту
    is_prime = True
    if number < 2:
        is_prime = False
    else:
        for i in range(2, int(number**0.5) + 1):
            if number % i == 0:
                is_prime = False
                break

    # Вывод результата
    if is_prime:
        print("Число является простым")
    else:
        print("Число является составным")
