'''Задание №1
Создайте несколько переменных разных типов. 
Проверьте к какому типу относятся созданные переменные.  
'''

# Создание переменных разных типов
var_int = 42
var_float = 3.14
var_string = "Привет, мир!"
var_boolean = True
var_list = [1, 2, 3]
var_tuple = (4, 5, 6)
var_dict = {"a": 1, "b": 2, "c": 3}

# Проверка типов переменных
print(type(var_int))      # <class 'int'>
print(type(var_float))    # <class 'float'>
print(type(var_string))   # <class 'str'>
print(type(var_boolean))  # <class 'bool'>
print(type(var_list))     # <class 'list'>
print(type(var_tuple))    # <class 'tuple'>
print(type(var_dict))     # <class 'dict'>
